StarshipDemonstration/StarshipDemonstration/system/controlDict
FoamFile
{
	class	dictionary;
	format	ascii;
	location	system;
	object	controlDict;
	version	2.0;
}
application	simpleFoam;
deltaT	1;
endTime	100;
purgeWrite	0;
startFrom	latestTime;
startTime	0;
stopAt	endTime;
timeFormat	general;
timePrecision	6;
writeControl	timeStep;
writeInterval	10;
writePrecision	7;
runTimeModifiable	true;
compression	uncompressed;
writeFormat	binary;
libs	("libfvMotionSolvers.dll" "libturbulenceModels.dll" "libturbulenceModelSchemes.dll" "libfvOptions.dll");
functions
{
	forceCoefficientMonitorOnStarship_Puck_V2_v6InDefault
	{
		type	forceCoeffs;
		U	U;
		Aref	1;
		dragDir	(1 0 0);
		lRef	1;
		liftDir	(0 0 1);
		magUInf	10;
		pitchAxis	(0 1 0);
		CofR	(0 0 0);
		enabled	true;
		log	true;
		patches	(Starship_Puck_V2_v6);
		rhoInf	1.0;
		libs	("libforces.dll");
		p	p;
		rho	rhoInf;
	}
}
OptimisationSwitches
{
	fileHandler	uncollated;
	fileModificationSkew	0;
	maxMasterFileBufferSize	1.0E9;
	maxThreadFileBufferSize	1.0E9;
	mpiBufferSize	200000000;
}
