StarshipDemonstration/StarshipDemonstration/system/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	blockMeshDict;
}
vertices	(
	(-0.512 -0.7325 -0.3325)
	(1.912 -0.7325 -0.3325)
	(1.912 0.7825 -0.3325)
	(-0.512 0.7825 -0.3325)
	(-0.512 -0.7325 1.1825)
	(1.912 -0.7325 1.1825)
	(1.912 0.7825 1.1825)
	(-0.512 0.7825 1.1825)
);
blocks	(
	hex	(0 1 2 3 4 5 6 7) (20 10 10) simpleGrading (1.0 1.0 1.0)
);
edges	();
boundary	(
	inlet
	{
		type	patch;
		faces	(
			(0 4 7 3)
		);
	}
	outlet
	{
		type	patch;
		faces	(
			(2 6 5 1)
		);
	}
	boundaries
	{
		type	patch;
		faces	(
			(1 5 4 0)
			(3 7 6 2)
			(0 3 2 1)
			(4 5 6 7)
		);
	}
);
