StarshipDemonstration/StarshipDemonstration/system/createPatchDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	createPatchDict;
}
pointSync	false;
patches	(
	{
		name	Starship_Puck_V2_v6;
		patchInfo
		{
			type	wall;
		}
		constructFrom	patches;
		patches	(Starship_Puck_V2_v6_default);
	}
);
