StarshipDemonstration/StarshipDemonstration/system/snappyHexMeshDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	snappyHexMeshDict;
}
castellatedMesh	true;
snap	true;
addLayers	true;
geometry
{
	Simulation_Volume.stl
	{
		type	triSurfaceMesh;
		simflowType	primitive;
		primitiveType	box;
		name	Simulation_Volume;
		max	(1.9000001 0.775 1.175);
		min	(-0.5 -0.725 -0.325);
		faceGroups
		{
			x_min
			{
				name	Simulation_Volume;
			}
			x_max
			{
				name	Simulation_Volume;
			}
			y_min
			{
				name	Simulation_Volume;
			}
			y_max
			{
				name	Simulation_Volume;
			}
			z_min
			{
				name	Simulation_Volume;
			}
			z_max
			{
				name	Simulation_Volume;
			}
		}
	}
	Starship_Puck_V2_v6.stl
	{
		type	triSurfaceMesh;
		simflowType	stl;
		name	Starship_Puck_V2_v6;
		includedAngle	120.0;
	}
}
castellatedMeshControls
{
	locationInMesh	(1.0 0.0 0.0);
	refinementSurfaces
	{
		Starship_Puck_V2_v6
		{
			level	( 2 4 );
			patchInfo
			{
				type	wall;
			}
		}
	}
	refinementRegions
	{
	}
	limitRegions
	{
	}
	features	
	(
	{
		file	"Starship_Puck_V2_v6.eMesh";
		levels	((0 0));
	}
	);
	maxLocalCells	1000000;
	maxGlobalCells	10000000;
	nCellsBetweenLevels	4;
	maxLoadUnbalance	0.1;
	minRefinementCells	10;
	resolveFeatureAngle	30.0;
	allowFreeStandingZoneFaces	true;
}
snapControls
{
	tolerance	1.0;
	nSmoothPatch	3;
	nSolveIter	500;
	nRelaxIter	5;
	nFeatureSnapIter	10;
	implicitFeatureSnap	true;
	explicitFeatureSnap	true;
	multiRegionFeatureSnap	true;
	nFaceSplitInterval	5;
}
addLayersControls
{
	layers
	{
		Starship_Puck_V2_v6
		{
			nSurfaceLayers	5;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
		Starship_Puck_V2_v6_patch0
		{
			nSurfaceLayers	5;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
	}
	relativeSizes	true;
	minThickness	0.1;
	firstLayerThickness	0.2;
	expansionRatio	1.25;
	nGrow	0;
	featureAngle	180.0;
	maxFaceThicknessRatio	0.5;
	nSmoothSurfaceNormals	5;
	nSmoothThickness	10;
	minMedialAxisAngle	90.0;
	maxThicknessToMedialRatio	0.5;
	nMedialAxisIter	100;
	nSmoothNormals	3;
	slipFeatureAngle	30.0;
	nRelaxIter	5;
	nBufferCellsNoExtrude	0;
	nLayerIter	50;
	nRelaxedIter	20;
	detectExtrusionIsland	true;
}
meshQualityControls
{
	maxNonOrtho	65.0;
	maxBoundarySkewness	20.0;
	maxInternalSkewness	4.0;
	maxConcave	80.0;
	minVol	1.0E-14;
	minTetQuality	1.0E-20;
	minArea	-1.0;
	minTwist	0.02;
	minTriangleTwist	-1.0;
	minDeterminant	0.01;
	minFaceWeight	0.05;
	minVolRatio	0.01;
	minVolCollapseRatio	0.1;
	nSmoothScale	4;
	errorReduction	0.75;
	relaxed
	{
		maxNonOrtho	75.0;
	}
}
mergeTolerance	1.0E-6;
debug	0;
