StarshipDemonstration/StarshipDemonstration/constant/turbulenceProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	turbulenceProperties;
}
simulationType	RAS;
RAS
{
	turbulence	true;
	printCoeffs	true;
	RASModel	kEpsilon;
	kEpsilonCoeffs
	{
		Cmu	0.09;
		C1	1.44;
		sigmaEps	1.3;
		C2	1.92;
	}
	delta	cubeRootVol;
	cubeRootVolCoeffs
	{
		deltaCoeff	1.0;
	}
}
