StarshipDemonstration/StarshipDemonstration/0/epsilon
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	epsilon;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -3 0 0 0 0];
internalField	uniform 1.0;
boundaryField
{
	inlet
	{
		type	turbulentMixingLengthDissipationRateInlet;
		value	uniform 1.0;
		mixingLength	0.001;
	}
	outlet
	{
		type	zeroGradient;
	}
	boundaries
	{
		type	turbulentMixingLengthDissipationRateInlet;
		value	uniform 1.0;
		mixingLength	0.001;
	}
	Starship_Puck_V2_v6
	{
		type	epsilonWallFunction;
		value	uniform 1.0;
	}
}
