StarshipDemonstration/StarshipDemonstration/0/k
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	k;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -2 0 0 0 0];
internalField	uniform 0.009999999776482582;
boundaryField
{
	inlet
	{
		type	turbulentIntensityKineticEnergyInlet;
		value	uniform 0.009999999776482582;
		intensity	0.05;
	}
	outlet
	{
		type	zeroGradient;
	}
	boundaries
	{
		type	turbulentIntensityKineticEnergyInlet;
		value	uniform 0.009999999776482582;
		intensity	0.05;
	}
	Starship_Puck_V2_v6
	{
		type	kqRWallFunction;
		value	uniform 0.009999999776482582;
	}
}
