StarshipDemonstration/StarshipDemonstration/0/nut
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	nut;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -1 0 0 0 0];
internalField	uniform 0.10999999940395355;
boundaryField
{
	inlet
	{
		type	calculated;
		value	uniform 0.10999999940395355;
	}
	outlet
	{
		type	calculated;
		value	uniform 0.10999999940395355;
	}
	boundaries
	{
		type	calculated;
		value	uniform 0.10999999940395355;
	}
	Starship_Puck_V2_v6
	{
		type	nutUWallFunction;
		value	uniform 0.10999999940395355;
	}
}
