StarshipDemonstration/StarshipDemonstration/system/surfaceFeatureExtractDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	surfaceFeatureExtractDict;
}
Starship_Puck_V2_v6.stl
{
	extractionMethod	extractFromSurface;
	includedAngle	120.0;
	geometricTestOnly	false;
}
